readme.org
#+title:  annt's GNU Emacs Configuration
#+author: anntnzrb
#+email:  anntnzrb@protonmail.com

#+language: en
#+startup:  show2levels
#+options:  author:t email:t
#+property: header-args :tangle "init.el" :results silent

# macros
#+macro: export-date     (eval (format-time-string "%F" (current-time)))
#+macro: emacs-version   (eval emacs-version)
#+macro: system-features (eval system-configuration-features)

- Creation date: 2020-11-07
- Last update: *{{{export-date}}}*

- /GNU Emacs/ system details
  - version: *{{{emacs-version}}}*
  - build features: *{{{system-features}}}*

* Early initialization

This section is responsible for the initial setup of Emacs. The setup
procedure is executed before the normal configuration loading.

#+begin_src emacs-lisp
;; GNU Emacs early initialisation -*- lexical-binding: t; -*-
#+end_src

** Emacs version, features and minimum requirements

The following states the minimum required version of Emacs to use this
configuration.  I do not plan on maintaining older or legacy versions.

#+begin_src emacs-lisp :tangle "early-init.el"
(let ((emacs-version-required "29.2"))
  (cond ((version< emacs-version emacs-version-required)
         (error "Emacs %s or newer is required; you're running %s" emacs-version-required emacs-version))
        ((not (version= emacs-version emacs-version-required))
         (warn "This configuration is tested with Emacs %s; you're running %s" emacs-version-required emacs-version))))
#+end_src

** Startup optimization

The garbage collector in Emacs can sometimes slow down the startup
process. By increasing the =gc-cons-threshold= to its maximum
value and modifying =gc-cons-percentage=, garbage collection is
effectively deferred until Emacs has finished loading. After startup,
these values are reset to more reasonable levels.

#+begin_src emacs-lisp :tangle "early-init.el"
(defconst annt/init--file-name-handler-alist file-name-handler-alist)
(defconst annt/init--vc-handled-backends     vc-handled-backends)

(setopt gc-cons-threshold  most-positive-fixnum)
(setopt gc-cons-percentage 0.5)

(setopt file-name-handler-alist nil)
(setopt vc-handled-backends     nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (progn
              (setopt gc-cons-threshold (* 1024 1024 20))
              (setopt gc-cons-percentage 0.2)
              (setopt file-name-handler-alist annt/init--file-name-handler-alist)
              (setopt vc-handled-backends annt/init--vc-handled-backends))))
#+end_src

** Native compilation

Silence some warnings native compilation shouts.

#+begin_src emacs-lisp :tangle "early-init.el"
(when (native-comp-available-p)
  (setopt native-comp-async-report-warnings-errors 'silent)
  (setopt native-compile-prune-cache t))
#+end_src

** Basic frame settings

Very basic UI settings, it's not extensive, as this is not the place to be.

#+begin_src emacs-lisp :tangle "early-init.el"
(setopt inhibit-x-resources         t)
(setopt inhibit-splash-screen       t)
(setopt inhibit-startup-screen      t)
(setopt inhibit-startup-buffer-menu t)
(setopt inhibit-startup-echo-area-message user-login-name)

(setopt frame-resize-pixelwise       t)
(setopt frame-inhibit-implied-resize t)

(setopt frame-title-format '("%b @ emacs"))

(menu-bar-mode   -1)
(tool-bar-mode   -1)
(scroll-bar-mode -1)
#+end_src

*** For information about GNU Emacs and the GNU system, type =C-h C-a=

I don't why this is a thing. Check [[https://yrh.dev/blog/rant-obfuscation-in-emacs/][this]] out.

#+begin_src emacs-lisp :tangle "early-init.el"
(eval-after-load "startup"
  '(fset 'display-startup-echo-area-message (lambda ())))
#+end_src

** Package initialization

#+begin_src emacs-lisp :tangle "early-init.el"
(setopt package-enable-at-startup nil)
#+end_src

* Initialization

#+begin_src emacs-lisp
;; GNU Emacs initialisation -*- lexical-binding: t; -*-
#+end_src

The following prompts the user to tangle the literate configuration
file before exiting (restarting) Emacs.

*Q: What is tangl{e,ing} a file?*

*A:* The process of extracting the source code blocks from
 the Org-mode document and writing them out to separate source code
 files.

#+begin_src emacs-lisp
(defconst annt/init--config-literate
  (expand-file-name "readme.org" user-emacs-directory)
  "File path of the literate configuration file.")

(defun annt/init--tangle-literate-config ()
  "Prompt to tangle literate configuration file."
  (interactive)
  (when (and (equal (buffer-file-name) annt/init--config-literate)
             (y-or-n-p "Save and tangle before exiting? "))
    (save-buffer)
    (org-babel-tangle)))

(add-hook 'kill-emacs-hook #'annt/init--tangle-literate-config)
#+end_src

** Helpers and auxiliaries

Section dedicated to providing utility functions (helpers) and macros that
enhance the configuring experience. The primary goal is to simplify and
streamline common tasks, such as, but not limited to, adding =N= functions to
=M= hooks in a single ~add-hook~ expression.

#+begin_src emacs-lisp
(defmacro annt/helpers--add-hook (hooks functions &optional depth local)
  "Replacement and wrapper for `add-hook'.
Add N FUNCTIONS to M HOOKS. Both optional DEPTH and LOCAL arguments are passed
to `add-hook'.

NOTE: The mode hook should not be quoted."
  (let ((hooksp (listp hooks))
        (fnsp   (listp functions)))
    (cond
     ;; both HOOKS and FUNCTIONS are lists
     ((and hooksp fnsp)
      `(mapc (lambda (hk)
               (mapc (lambda (fn)
                       (add-hook 'hk fn ,depth ,local))
                     ,functions))
             ,hooks))

     ;; only HOOKS is a list
     (hooksp
      `(mapc (lambda (hk)
               (add-hook 'hk ,functions ,depth ,local))
             ,hooks))

     ;; only FUNCTIONS is a list
     (fnsp
      `(mapc (lambda (fn)
               (add-hook ',hooks fn ,depth ,local))
             ,functions))

     ;; neither HOOKS nor FUNCTIONS is a list
     ((not (or hooksp fnsp))
      `(add-hook ',hooks ,functions ,depth ,local))

     ;; fallback to error message
     (t `(error "Invalid arguments: hooks and functions should be either a symbol or a list")))))

(defalias 'add-hook! #'annt/helpers--add-hook)
#+end_src

*** Environment

The following serves adding directories to the system's =PATH= that may contain
executables you want Emacs to be able to use.

Examples:

- Nix
- Rust's Cargo
- Haskell's GHCup

#+begin_example
(append-path "~/scripts")
#+end_example

#+begin_src emacs-lisp
;;;###autoload
(defun append-path (path)
  "Add the specified PATH to the `exec-path' and 'PATH' environment variable."
  (let ((expanded-path (expand-file-name path)))
    (if (file-directory-p expanded-path)
        (progn
          (add-to-list 'exec-path expanded-path)
          (setenv "PATH" (concat (getenv "PATH") path-separator expanded-path)))
      (warn "Warning: %s is not a directory" expanded-path))))
#+end_src

*** Content uploading

The following is a convenient tool for sharing text data directly from the Emacs
session. It allows uploading a selected region of text from any buffer directly
to [[https://termbin.com/][termbin]], which is a online service that accepts text data sent to it and
returns a unique URL where the data can be viewed in plain text.

*NOTE*: this tool requires having the =nc= command present on your system; it
should be very easy to install as it is widely packaged.

#+begin_src emacs-lisp
;;;###autoload
(defun termbin-upload (start end)
  "Uploads region between START and END to termbin.com and copies resulting URL.

This function operates asynchronously."
  (interactive "r")
  (let* ((content (buffer-substring-no-properties start end))
         (proc (make-process :name "termbin-upload"
                             :command '("nc" "termbin.com" "9999")
                             :connection-type 'pipe
                             :buffer nil
                             :filter (lambda (_ string)
                                       (let ((trimmed-string (string-trim-right string "[\n\0]+")))
                                         (message "Uploaded and copied URL: %s" trimmed-string)
                                         (kill-new trimmed-string))))))
    (message "Uploading...")
    (process-send-string proc content)
    (process-send-eof proc)))
#+end_src

** Custom(isation)

#+begin_src emacs-lisp
(use-package cus-edit
  :config
  (setopt custom-buffer-done-kill t))
#+end_src

*** Custom file

#+begin_src emacs-lisp
(setopt custom-file (make-temp-file "emacs-custom-file-"))
#+end_src

** Package management

#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; use bleeding-edge straight.el
(setopt straight-repository-branch "master")

;; do not fully clone repos, just not needed
(setopt straight-vc-git-default-clone-depth 1)

;; always prefer native compilation
(setopt straight-disable-compile nil)
(setopt straight-disable-native-compile nil)
#+end_src

** Essentials

#+begin_src emacs-lisp
(use-package emacs
  :config

  (setopt read-answer-short t)
  (setopt use-short-answers t)

  ;; reverting/refreshing/updating
  (setopt auto-revert-verbose t)
  (global-auto-revert-mode +1))
#+end_src

