readme.org
*** ~use-package~

#+begin_src emacs-lisp
(use-package use-package
  :config
  ;; always lazy load packages, unless instructed otherwise; use `:demand' to do
  ;; so, for extra info, see:
  ;; <https://github.com/jwiegley/use-package#notes-about-lazy-loading>
  (setopt use-package-verbose           nil)
  (setopt use-package-always-defer        t)
  (setopt use-package-check-before-init nil) ;; performance hit
  (setopt use-package-compute-statistics  t)
  (setopt use-package-ignore-unknown-keywords nil)

  ;; force using the "-hook" suffix, this should be default...
  (setopt use-package-hook-name-suffix nil)

  (defmacro annt/package--use-package-external-package (package &rest body)
    "Wrapper around `use-package' with external package integration; `straight.el'
  in this case.
  PACKAGE and BODY are as in `use-package.'"
    (declare (indent 1))
    `(use-package ,package :straight t ,@body))

  (defalias 'use-package! #'annt/package--use-package-external-package))
#+end_src

*** Emacs as a server

When Emacs is launched, it will now boot its server as well, =emacsclient=. This
allows sharing resources with the initially ran Emacs process. Once Emacs is
killed, the server is too.

I don't particularly use this feature, yet I see it can be handy in some
scenarios, and having the server started does not hurt either.

#+begin_src emacs-lisp
(use-package server
  :demand t
  :config
  (setopt server-client-instructions nil)
  (unless (server-running-p)
    (server-start)))
#+end_src

*** Leader key & other Keymaps

#+begin_src emacs-lisp
(use-package keymap
  :config
  (defvar-keymap annt/keys--leader-prefix-map
    :doc "annt's leader keymap.")

  (defun annt/misc--goto-emacs-config-directory ()
    "Opens one's Emacs configuration directory."
    (interactive)
    (find-file user-emacs-directory))

  (defun annt/misc--goto-emacs-config-file ()
    "Opens one's Emacs configuration file."
    (interactive)
    (find-file (expand-file-name "readme.org" user-emacs-directory)))

  (keymap-set global-map "C-z" annt/keys--leader-prefix-map)

  :bind
  (:map annt/keys--leader-prefix-map
        ;; system
        ("/ r" . restart-emacs)
        ("/ q" . save-buffers-kill-terminal)

        ;; buffer
        ("b r" . restart-emacs)

        ;; private configuration
        ("f p d" . annt/misc--goto-emacs-config-directory)
        ("f p p" . annt/misc--goto-emacs-config-file)))
#+end_src

*** Backups & Lock files

#+begin_src emacs-lisp
(setopt backup-inhibited nil)
(setopt create-lockfiles nil)
(setopt make-backup-files nil)
#+end_src

*** Scroll

#+begin_src emacs-lisp
(use-package pixel-scroll
  :demand t
  :config
  (pixel-scroll-precision-mode +1))
#+end_src

*** Help

Refer to the [[Helpful][Helpful]] section.

#+begin_src emacs-lisp
(use-package help
  :config
  (setopt help-window-keep-selected t)
  (setopt help-window-select        t))
#+end_src

*** Convenience

**** Helpful

#+begin_src emacs-lisp
(use-package! helpful
  :bind
  (:map help-map
        ("o" . helpful-symbol)
        ("f" . helpful-callable)
        ("v" . helpful-variable)
        ("k" . helpful-key)
        ("x" . helpful-command)))
#+end_src

**** which-key

#+begin_src emacs-lisp
(use-package! which-key
  :defer 2
  :config
  (setopt which-key-lighter           "")
  (setopt which-key-separator     " ➡ ")
  (setopt which-key-prefix-prefix "... ")

  (setopt which-key-add-column-padding     16)
  (setopt which-key-max-display-columns     4)
  (setopt which-key-max-description-length 40)

  ;; timings
  (setopt which-key-idle-delay            0.5)
  (setopt which-key-idle-secondary-delay 0.25)

  (which-key-mode +1))
#+end_src

** Buffers

By default, the initial buffer =*scratch*= runs the =lisp-interaction-mode=
mode, to write ELisp, obviously. I see far more favorable using a regular text
buffer and switch if needed.

#+begin_src emacs-lisp
(use-package emacs
  :config
  (setopt initial-buffer-choice t) ;; *scratch* buffer
  (setopt initial-major-mode 'text-mode)
  (setopt initial-scratch-message nil)

  :bind
  (:map ctl-x-map
        ("k" . kill-current-buffer)))
#+end_src

** Editing

*** Indentation and the =TAB= key

The following settings are global.  Refer to the language's proper
section for specifics.

#+begin_src emacs-lisp
(use-package emacs
  :config
  (setopt tab-width 4)

  ;; do not use tabs
  (setopt indent-tabs-mode nil)

  ;; indent behaviour
  (setopt tab-always-indent 'complete)

  ;; req. `tab-always-indent'
  (setopt tab-first-completion 'word-or-paren-or-punct))
#+end_src

*** Text Wrapping and Auto-Fill(ing)

#+begin_src emacs-lisp
(use-package emacs
  :config
  (setopt fill-column 80)
  (setopt sentence-end-double-space nil)

  ;; sentences MUST end with a period
  (setopt sentence-end-without-period nil)

  :bind
  (:map ctl-x-map
        ("f" . nil)))
#+end_src

*** Vi emulation

#+begin_src emacs-lisp
(use-package! evil
  :demand t
  :init
  (setopt evil-echo-state      nil)
  (setopt evil-overriding-maps nil)
  (setopt evil-want-fine-undo    t)
  (setopt evil-want-keybinding nil)
  (setopt evil-want-minibuffer nil)

  ;; native undo-redo (emacs28+)
  (setopt evil-undo-system 'undo-redo)

  (evil-mode +1)

  :bind
  (:map evil-motion-state-map
        ("C-z" . nil)))
#+end_src

**** Extras

#+begin_src emacs-lisp
(use-package! evil-collection
  :demand t
  :after evil
  :config
  (setopt evil-collection-want-unimpaired-p nil)

  (evil-collection-init))
#+end_src

*** Miscellaneous

Some other settings that I do not categorize in specifics.

#+begin_src emacs-lisp
(use-package emacs
  :init
  (add-hook! emacs-startup-hook '(show-paren-mode))
  :config
  (setopt show-paren-style 'mixed)
  (setopt show-paren-when-point-inside-paren nil)
  (setopt show-paren-context-when-offscreen 'child-frame))
#+end_src

** Completion

Suggested resources:
- =completion-styles=
- [[https://www.youtube.com/live/fnE0lXoe7Y0?si=29m2wSpmF-O1FwUN][Emacs Completion Explained - Andrew Tropin]]

#+begin_src emacs-lisp
(use-package emacs
  :config
  ;; FIXME: `setopt' fails
  (setq completion-styles '(basic substring initials flex partial-completion orderless))

  ;; do not need anything case-specific most of the time (?)
  (setopt completion-ignore-case                t)
  (setopt read-buffer-completion-ignore-case    t)
  (setopt read-file-name-completion-ignore-case t))
#+end_src

*** Orderless

Check the pertintent section regarding =completion-styles=.

#+begin_src emacs-lisp
(use-package! orderless
  :defer 2
  :config
  (setopt orderless-matching-styles
          '(orderless-prefixes orderless-regexp)))
#+end_src

** Modeline

#+begin_src emacs-lisp
(use-package! doom-modeline
  :disabled t
  :demand t
  :config
  (setopt doom-modeline-icon t)

  ;; buffer
  (setopt doom-modeline-buffer-name                    t)
  (setopt doom-modeline-buffer-encoding                t)
  (setopt doom-modeline-buffer-state-icon              t)
  (setopt doom-modeline-buffer-file-name-style         'truncate-with-project)
  (setopt doom-modeline-buffer-modification-icon       t)
  (setopt doom-modeline-highlight-modified-buffer-name t)

  (setopt doom-modeline-column-zero-based nil)
  (setopt doom-modeline-total-line-number t)

  ;; modal
  (setopt doom-modeline-modal                      t)
  (setopt doom-modeline-modal-icon                 t)
  (setopt doom-modeline-modal-modern-icon          t)
  (setopt doom-modeline-always-show-macro-register t)

  ;; modes
  (setopt doom-modeline-major-mode-icon       t)
  (setopt doom-modeline-major-mode-color-icon t)
  (setopt doom-modeline-minor-modes           nil)

  (add-hook 'emacs-startup-hook  #'doom-modeline-mode))
#+end_src

*** Keycast

#+begin_src emacs-lisp
(use-package! keycast
  :defer 2
  :config
  (setopt keycast-mode-line-format "%k%c%R")
  ;; don't hide rest of the modeline
  (setopt keycast-mode-line-remove-tail-elements nil) 

  (defconst annt/keycast--events-disabled
    '(mouse-event-p
      mouse-movement-p
      mwheel-scroll
      pixel-scroll-precision
      pixel-scroll-start-momentum)
    "List of disabled events that keycast should ignore.")

  (defconst annt/keycast--events-typing
    '(self-insert-command
      org-self-insert-command
      isearch-printing-char
      isearch-delete-char)
    "List of disabled events that keycast should interpret as typing.")

  (mapc (lambda (ev)
          (add-to-list 'keycast-substitute-alist `(,ev nil nil)))
        annt/keycast--events-disabled)

  (mapc (lambda (ev)
          (add-to-list 'keycast-substitute-alist `(,ev "." "Typing…")))
        annt/keycast--events-typing))
#+end_src

