init.el

(use-package minibuffer
  :config
  (setopt minibuffer-default-prompt-format " [%s]")
  (setopt resize-mini-windows t)

  ;; save minibuffer history across sessions
  (setopt history-length t)
  (setopt history-delete-duplicates t)
  (savehist-mode +1)

  ;; hide default value when typing
  (minibuffer-electric-default-mode +1)

  ;; remove "shadow" greyed out parts
  (file-name-shadow-mode +1)

  :bind
  (:map minibuffer-mode-map
        ;; unlikely to use an actual tab character, so prefer completion
        ("M-\\" . dabbrev-expand)))

(use-package! vertico
  :config
  (setopt vertico-cycle    t)
  (setopt vertico-count   12)
  (setopt vertico-resize nil)
  (setopt vertico-scroll-margin (/ vertico-count 2))
  (setopt vertico-sort-function 'vertico-sort-history-length-alpha)

  :bind
  (:map vertico-map
        ("C-j" . vertico-next)
        ("C-k" . vertico-previous))

  :init
  (vertico-mode +1))

(use-package! marginalia
  :defer 1
  :config
  (setopt marginalia-align  'left)
  (setopt marginalia-separator "    ")
  (setopt marginalia-max-relative-age 0)

  (marginalia-mode +1))

(use-package! nerd-icons-completion
  :defer 3
  :config
  (nerd-icons-completion-mode +1))

(use-package! nerd-icons-completion
  :after marginalia
  :config
  (nerd-icons-completion-marginalia-setup))

(use-package emacs
  :after custom
  :config
  (let ((time (string-to-number (format-time-string "%H"))))
    (defconst annt/themes--time-day-p (and (> time 9) (< time 18))
      "Non-nil if the time of the day is daylight.")
    (defconst annt/themes--time-night-p (not annt/themes--time-day-p)
      "Non-nil if the time of the day is the dark night.")))

(use-package modus-themes
  :demand t
  :init
  (load-theme 'modus-operandi t t) ;; load; no enabling yet
  :config
  (setq modus-themes-links         '(background italic))
  (setq modus-themes-region        '(no-extend bg-only accented))
  (setq modus-themes-syntax        '(green-strings yellow-comments))
  (setq modus-themes-mode-line     '(accented borderless))
  (setq modus-themes-org-blocks    'greyscale)
  (setq modus-themes-paren-match   '(bold underline))
  (setq modus-themes-bold-constructs   t)
  (setq modus-themes-italic-constructs t)

  ;; use operandi for daylight
  (modus-themes-load-operandi)

  :bind
  (:map global-map
        ("M-<f5>" . modus-themes-toggle)))

(use-package! ef-themes
  :disabled t
  :demand t
  :config
  ;; use any dark theme for night
  (when annt/themes--time-night-p
    (ef-themes-load-random 'dark)))

(use-package! fontaine
  :init
  (setopt text-scale-remap-header-line t)

  (setopt fontaine-presets
          '(;
            (iosevka-mononoki
             :default-family "mononoki"
             :variable-pitch-family "Iosevka Comfy Motion"
             :variable-pitch-weight semilight)

            (mononoki-iosevka
             :default-family "Iosevka Comfy Motion"
             :variable-pitch-family "mononoki"
             :variable-pitch-weight semilight)

            ;; fallback
            (default)
            (t
             :default-family nil
             :default-weight regular
             :default-height 130

             :variable-pitch-family nil
             :variable-pitch-weight nil
             :variable-pitch-height 1.0

             :fixed-pitch-family nil
             :fixed-pitch-weight nil
             :fixed-pitch-height 1.0

             :fixed-pitch-serif-family nil
             :fixed-pitch-serif-weight nil
             :fixed-pitch-serif-height 1.0

             :bold-family nil
             :bold-weight bold
             :italic-family nil
             :italic-slant italic

             :line-spacing nil)))

  ;; Set last preset or fall back to desired style from `fontaine-presets'.
  (fontaine-set-preset (or (fontaine-restore-latest-preset) 'default))

  (add-hook 'kill-emacs-hook        #'fontaine-store-latest-preset)
  (add-hook 'enable-theme-functions #'fontaine-apply-current-preset))

(use-package! nerd-icons :defer 3)

(use-package org
  :config
  (setopt org-src-window-setup       'current-window)
  (setopt org-src-fontify-natively   t)
  (setopt org-confirm-babel-evaluate nil)

  ;; identation
  (setopt org-src-preserve-indentation     t)
  (setopt org-edit-src-content-indentation 0)

  ;; use major mode's tabs for src blocks
  (setopt org-src-tab-acts-natively t))

(use-package dired
  :init
  (add-hook! dired-mode-hook '(dired-hide-details-mode hl-line-mode))

  :config
  (setopt dired-recursive-copies    'always)
  (setopt dired-recursive-deletes   'always)
  (setopt delete-by-moving-to-trash t)

  ;; do not display available space (top)
  (setopt dired-free-space nil)

  ;; update dired contents when directory contens change
  (setopt dired-auto-revert-buffer #'dired-directory-changed-p)

  ;; `man' ls for extra flags info 
  (setopt dired-listing-switches
          "-AGFhlv --group-directories-first --time-style=long-iso")

  ;; smart dired
  (setopt dired-dwim-target t)

  ;; when renaming (mv) a vc-controlled file, use vc mv over traditional mv
  (setopt dired-vc-rename-file t)

  ;; offer creating specified directory paths if missing
  (setopt dired-create-destination-dirs 'always)
  (setopt dired-create-destination-dirs-on-trailing-dirsep t)

  :bind
  (:map dired-mode-map
        ("C-+" . dired-create-empty-file)))

(use-package wdired
  :after dired
  :config
  (setopt wdired-allow-to-change-permissions t)
  (setopt wdired-create-parent-directories   t))

(use-package! dired-subtree
  :after dired
  :bind
  (:map dired-mode-map
        ("<tab>"     . dired-subtree-toggle)
        ("<backtab>" . dired-subtree-remove)))

(use-package! nerd-icons-dired
  :after dired
  :init
  (add-hook! dired-mode-hook '(nerd-icons-dired-mode)))

(use-package! consult
  :bind
  (:map goto-map
        ("i"   . consult-imenu)
        ("g"   . consult-goto-line)
        ("M-g" . consult-goto-line)
        ("o"   . consult-outline))
  (:map search-map
        ("@"   . consult-kmacro)
        ("d"   . consult-fd)
        ("g"   . consult-ripgrep)
        ("s"   . consult-line)
        ("M-s" . consult-line)
        ("i" . consult-info))
  (:map ctl-x-map
        ("b" . consult-buffer)

        ;; ctl-x-4-map
        ("4 b" . consult-buffer-other-window)

        ;; ctl-x-r-map
        ("r b" . consult-bookmark)

        ;; project map
        ("p b" . consult-project-buffer))
  (:map annt/keys--leader-prefix-map
        ("b b" . consult-buffer))
  (:map minibuffer-local-map
        ("M-r" . consult-history)))

(use-package! magit
  :config
  (setopt magit-define-global-key-bindings nil)

  :bind
  (:map global-map
        ("C-c g g" . magit-status)))

(use-package project
  :config
  (setopt project-kill-buffers-display-buffer-list t))

(use-package! nix-mode
  :mode "\\.nix\\'"
  :init
  ;; treat flake.lock files as json
  (add-to-list 'auto-mode-alist (cons "/flake\\.lock\\'" 'js-mode))
  :config
  (add-hook 'nix-mode-local-vars-hook #'tree-sitter! 'append))
